ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаказНаСборку/ЗаказНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b1dfe632-f392-4509-be4f-e18b73ce726b">
  <name>ЗаказНаСборку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c9a79b40-dfb8-4d19-8f24-19479b5077a6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c25e0db-85b8-43c8-bd2c-9585c71f7abb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613dd09b-8d9f-4696-bb8c-4c549f7964f2">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aee38b32-1a5b-4f61-8dc2-99c016377ffd">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e57fe9-4322-4cce-ab04-50ad6ba1b970">
    <name>ВариантОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3ca702ef-460f-45a1-8246-24e8fed96f63">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d36e55d0-c896-4beb-b33b-b92cef686a32">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44a308b8-55d3-4b73-b2e9-887f1da287eb">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16fd72e-431d-4747-bbd8-6d6c0b30c93c">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ce3f6ee-d33b-48c0-8c64-e3142f1d6418">
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ee9922c5-f6bd-40b2-8afc-e6beeb766d03">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67addbb6-c8a9-4f19-82d8-7fad629251a7">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7873695c-e1c9-4bc1-9aed-ab8d33fc60a6">
    <name>ВариантКомплектации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ab5257a-9c1c-44f3-b0c7-281f6a83d4a7">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab181519-cc9a-4b49-97ac-236db9d513ba">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c61f4a8-d130-48ad-9427-98115eec53f5">
    <name>СтатусУказанияСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="010c97c2-fba0-4184-8c33-8959792d7cc3">
    <name>КоличествоОтменено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7a51fce6-be1a-4b36-9188-31f7b4a10b30">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7115a331-3286-43af-b3ff-dc63b67d9660">
    <name>ДлительностьСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="429809b1-a26a-4bdd-aa88-cd76318044d8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="53d83f8b-f88d-4744-9cf0-b4b671905a41">
    <name>НачалоСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93945c86-4eac-42c4-8953-c8cc1bfb2c12">
    <name>ОкончаниеСборкиРазборки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6ef50f49-36a2-4ee2-9c0e-ed8fa286a765">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a50092-f626-41bb-84a2-ed4397d6865f">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="43f05447-cd8f-4549-b5a5-6196ebfbabe0">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a9971bf-e211-445a-b058-48e6b6fd45bb">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3ac99c5a-a679-4c7b-bf90-d6de651b8fcf">
    <name>МаксимальныйКодСтроки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44276cc6-18a5-405a-a061-41cd57801cd8">
    <name>КоличествоУпаковокОтменено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4defa09d-4411-4a4b-a9d8-d8dca5e76f2c">
    <name>НазначениеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="007d75ac-7be9-4628-9fd7-ef8aa2f58506">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bd881f5-ac5d-4b7b-9636-48e3fd14585b">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c6cb23a-9c6a-4211-a772-ac9095e991f7">
    <name>Обособленно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f291358e-4556-4e23-8728-3eb7f8587728">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f3105081-e6f3-4558-9808-cce8e494cf84">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c00c1f76-cd64-4f67-a639-14bea5cfa177">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1e93e976-c5e8-4c57-9fc0-e6e3f7dc5d73">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9a8eaf86-52f2-4338-b434-30faba66ce69">
      <name>УказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1321cce4-0c0c-4651-9d6b-ab17eaf2d93c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f33ded88-1f22-460b-8350-3b16c4db6e87">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9fb5f62-f3a1-4b0d-a4d2-446fa832a0fa">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7f69bdca-abb9-4385-9551-f921eda1f1db">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f27c34c-94be-4622-a1b7-b4ad53823203">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4893359f-9d16-4f03-927b-d4030c8f66f5">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aab1f1a8-7fae-4d77-ae88-3c7929d0d31d">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d0cd0c4d-5884-41cd-befd-ae573bc364a5">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="633fdcc4-2036-4aae-bd60-14f614c41ff4">
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ddf38676-e2fd-460f-8f37-ea449673d7e5">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0edae8d0-09ba-438c-abf7-8887cbd2c8f8">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4121e1b8-8f4f-47bb-aad7-c4848b40d52c">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a094195c-68c7-4878-b3b3-d1e717a1f057">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="200040ea-51d1-4796-aa3a-509f0867ab5f">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5c905d20-7666-479b-977d-71ddd005c72d">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ЗаказНаСборку/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИТБК_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если не Объект.Товары.Количество() тогда
		ИТБК_НоменклатураПриИзмененииПослеНаСервере();
		ЗаполнитьКомплектующими(Неопределено);
	КонецЕсли;
КонецПроцедуры                                


&НаСервере
Процедура ИТБК_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   ТекущийОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт ; // КВыполнению
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   ТекущийОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт ; // КВыполнению
	
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ПослеЗаписиПосле(ПараметрыЗаписи)
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ; //КВыполнению
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ; //КВыполнению
КонецПроцедуры


&НаСервере
Процедура ИТБК_НоменклатураПриИзмененииПослеНаСервере()
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306");
	Значение = объект.Номенклатура.ДополнительныеРеквизиты.Найти(Свойство);
	Если Значение <>  Неопределено 
		и Значение.Значение = Истина тогда
		Сообщить("Номенклатура """ + объект.Номенклатура + """ является автоизготавливаемой, изготовление невозможно");
		объект.Номенклатура = "";
		Возврат;
	КонецЕсли;
	

	Если объект.Номенклатура.ВидНоменклатуры.ИспользоватьСерии тогда
		объект.Количество = 1;
		объект.КоличествоУпаковок = 1 ;
		объект.Упаковка = Неопределено;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ИТБК_НоменклатураПриИзмененииПосле(Элемент)
	ИТБК_НоменклатураПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_КоличествоУпаковокПриИзмененииПосле(Элемент)
	ИТБК_НоменклатураПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_СтатусПриИзмененииПосле(Элемент)
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ; //КВыполнению
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ; //КВыполнению
КонецПроцедуры


&НаСервере
Процедура ИТБК_ПриОткрытииПослеНаСервере()
	
	если объект.Ссылка.Пустая()  и не объект.ВариантКомплектации.Пустая() тогда
		ЗаполнитьТоварыПоВариантуКомплектации();
	КонецЕсли;
	Элементы.Товары.ТолькоПросмотр = Истина;
	Элементы.ТоварыРазбитьСтроку.Доступность = Ложь;
	Элементы.ТоварыВставитьСтроки.Доступность = Ложь;
	Элементы.ТоварыСкопироватьСтроки.Доступность = Ложь;
	Элементы.ТоварыПодобратьТовары.Доступность = Ложь;
	Элементы.ТоварыОтменитьВыделенныеСтроки.Доступность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ПриОткрытииПосле(Отказ)
	ИТБК_ПриОткрытииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОчиститьСохраненныеДанные()
	
	//запишем пустой набор для очистки
	МатериалыКомплектации = РегистрыСведений.ИТБК_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	МатериалыКомплектации.Отбор.ЗаказНаСборку.Установить(Объект.Ссылка);
	МатериалыКомплектации.Записать();
	
	МатериалыКомплектации = РегистрыСведений.vs_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	МатериалыКомплектации.Отбор.ЗаказНаСборку.Установить(Объект.Ссылка);
	МатериалыКомплектации.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ВариантКомплектацииЗавершение(Ответ, ДП) Экспорт
	
	Если  ответ = КодВозвратаДиалога.Да тогда
		Объект.Товары.Очистить();
		Объект.ВариантКомплектации = ДП;
		ЗаполнитьКомплектующими(Неопределено);
		ВариантКомплектацииПриИзменении(Элементы.ВариантКомплектации);
		ОчиститьСохраненныеДанные();
		ПоказатьПредупреждение(,"После записи документа необходимо перевыбрать заказ в рабочем месте Изготовления,если оно открыто",
		,"Внимание!!!");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_ВариантКомплектацииОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение<>Объект.ВариантКомплектации и не Объект.Ссылка.Пустая() тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(новый ОписаниеОповещения("ИТБК_ВариантКомплектацииЗавершение",ЭтаФорма,ВыбранноеЗначение),
		"При смене Варианта комплектации, состав материалов, потребляемых  при изготовлении, будет изменен в соответствии с новым Вариантом комплектации. Все изменения в составе материалов, внесенные ранее, будут потеряны! Продолжить?
		|Убедитесь, что в производстве не начато изготовление этого заказа  по старому (прежнему) Варианту комплектации!",
		РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры
